Revit.Elements.StructuralFraming.Type
Gets family type from the specified structural element
symbol

Revit.Elements.StructuralFraming.ByCurveLevelUpVectorAndType(Autodesk.DesignScript.Geometry.Curve,Revit.Elements.Level,Autodesk.DesignScript.Geometry.Vector,Revit.Elements.StructuralType,Revit.Elements.FamilyType)
Create a Revit Structural Member - a special FamilyInstance
curve: The curve path for the structural member
upVector: The up vector for the element - this is required to determine the orientation of the element
level: The level on which the member should appear
structuralType: The type of the structural element - a beam, column, etc
structuralFramingType: The structural framing type representing the structural type
Returns:

Revit.Elements.StructuralFraming.BeamByCurve(Autodesk.DesignScript.Geometry.Curve,Revit.Elements.Level,Revit.Elements.FamilyType)
Create a beam.
curve: The curve which defines the center line of the beam.
level: The level with which you'd like the beam to be associated.
structuralFramingType: The structural framing type representing the beam.
Returns:

Revit.Elements.StructuralFraming.BraceByCurve(Autodesk.DesignScript.Geometry.Curve,Revit.Elements.Level,Revit.Elements.FamilyType)
Create a brace.
curve: The cruve which defines the center line of the brace.
level: The level with which you'd like the brace to be associated.
structuralFramingType: The structural framing type representing the brace.
Returns:

Revit.Elements.StructuralFraming.ColumnByCurve(Autodesk.DesignScript.Geometry.Curve,Revit.Elements.Level,Revit.Elements.FamilyType)
Create a column.
curve: The curve which defines the center line of the column.
level: The level with which you'd like the column to be associated.
structuralColumnType: The structural column type representing the column.
Returns: